-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2022 年 08 月 12 日 04:08
-- 伺服器版本： 10.4.21-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `shuyoung`
--

-- --------------------------------------------------------

--
-- 資料表結構 `order_detail`
--

CREATE TABLE `order_detail` (
  `order_id` varchar(255) NOT NULL,
  `member_id` int(11) NOT NULL,
  `adults` int(11) NOT NULL,
  `kids` int(11) NOT NULL,
  `totalPrice` int(11) NOT NULL,
  `room_id` int(11) NOT NULL,
  `room_type_id` int(11) NOT NULL,
  `room_folder` varchar(100) NOT NULL,
  `room_image` varchar(100) NOT NULL,
  `room_name` varchar(100) NOT NULL,
  `perNight` varchar(255) NOT NULL,
  `start_date` date NOT NULL,
  `end_date` date NOT NULL,
  `create_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `order_detail`
--

INSERT INTO `order_detail` (`order_id`, `member_id`, `adults`, `kids`, `totalPrice`, `room_id`, `room_type_id`, `room_folder`, `room_image`, `room_name`, `perNight`, `start_date`, `end_date`, `create_at`) VALUES
('1', 127, 4, 0, 5800, 4, 2, 'family', 'family-typeC5.jpg', '親子同遊帳', '', '2022-08-12', '2022-08-13', '2022-08-10 16:00:00'),
('10', 145, 4, 0, 12800, 1, 1, 'beauty', 'roomA8.jpeg', '頂級星空帳', '', '2022-08-18', '2022-08-19', '2022-08-11 05:36:10'),
('11', 145, 4, 0, 12800, 1, 1, 'beauty', 'roomA8.jpeg', '頂級星空帳', '', '2022-08-11', '2022-08-12', '2022-08-11 05:49:33'),
('12', 145, 8, 0, 7800, 5, 2, 'family', 'family-typeB1.jpeg', '闔家歡聚帳', '', '2022-11-17', '2022-11-19', '2022-08-11 06:01:00'),
('13', 145, 6, 0, 1200, 9, 4, 'camp', 'B1.jpeg', '搭棚遮雨區', '', '2022-08-19', '2022-08-20', '2022-08-11 06:08:47'),
('14', 145, 6, 0, 1500, 10, 4, 'camp', 'C1.jpeg', '木製屋頂區', '', '2022-08-12', '2022-08-13', '2022-08-11 06:55:55'),
('15', 145, 4, 0, 12800, 1, 1, 'beauty', 'roomA8.jpeg', '頂級星空帳', '', '2022-08-30', '2022-08-31', '2022-08-11 06:55:55'),
('16', 145, 4, 0, 5800, 4, 2, 'family', 'family-typeC5.jpg', '親子同遊帳', '', '2022-08-26', '2022-08-27', '2022-08-11 07:18:38'),
('1660221963149', 145, 8, 0, 7800, 5, 2, 'family', 'family-typeB1.jpeg', '闔家歡聚帳', '', '2022-08-12', '2022-08-13', '2022-08-11 12:46:03'),
('1660228236065', 145, 4, 0, 5800, 4, 2, 'family', 'family-typeC5.jpg', '親子同遊帳', '', '2022-08-20', '2022-08-26', '2022-08-11 14:30:36'),
('1660228325675', 145, 4, 0, 5800, 4, 2, 'family', 'family-typeC5.jpg', '親子同遊帳', '', '2022-08-20', '2022-08-26', '2022-08-11 14:32:05'),
('1660228773238', 145, 4, 0, 5800, 4, 2, 'family', 'family-typeC5.jpg', '親子同遊帳', '', '2022-08-20', '2022-08-26', '2022-08-11 14:39:33'),
('1660228791578', 145, 4, 0, 5800, 4, 2, 'family', 'family-typeC5.jpg', '親子同遊帳', '', '2022-08-20', '2022-08-26', '2022-08-11 14:39:51'),
('1660231407160', 145, 4, 0, 5800, 4, 2, 'family', 'family-typeC5.jpg', '親子同遊帳', '', '2022-08-30', '2022-08-31', '2022-08-11 15:23:27'),
('1660232336771', 145, 2, 0, 3000, 6, 3, 'van', 'campingVan_A5.jpeg', '望山露營車', '1', '2022-08-24', '2022-08-25', '2022-08-11 15:38:56'),
('1660232477244', 145, 6, 0, 16800, 2, 1, 'beauty', 'roomE1.jpeg', '網美神殿帳', '1', '2022-08-26', '2022-08-27', '2022-08-11 15:41:17'),
('1660232551230', 145, 8, 0, 20800, 3, 1, 'beauty', 'roomC1.jpeg', '印第安帳', '1', '2022-08-18', '2022-08-19', '2022-08-11 15:42:31'),
('1660232911688', 145, 2, 0, 3000, 6, 3, 'van', 'campingVan_A5.jpeg', '望山露營車', '2', '2022-09-20', '2022-09-22', '2022-08-11 15:48:31'),
('1660233141790', 145, 4, 0, 12800, 1, 1, 'beauty', 'roomA8.jpeg', '頂級星空帳', '4', '2022-09-12', '2022-09-16', '2022-08-11 15:52:21'),
('1660233686721', 145, 8, 0, 7800, 5, 2, 'family', 'family-typeB1.jpeg', '闔家歡聚帳', '1', '2022-08-19', '2022-08-20', '2022-08-11 16:01:26'),
('1660233755952', 145, 4, 0, 12800, 1, 1, 'beauty', 'roomA8.jpeg', '頂級星空帳', '3', '2022-09-11', '2022-09-14', '2022-08-11 16:02:35'),
('1660234751124', 145, 4, 0, 12800, 1, 1, 'beauty', 'roomA8.jpeg', '頂級星空帳', '1', '2022-08-24', '2022-08-25', '2022-08-11 16:19:11'),
('1660234857315', 145, 4, 0, 4800, 7, 3, 'van', 'campingVan_B1.jpeg', '賞星露營車', '1', '2022-08-25', '2022-08-26', '2022-08-11 16:20:57'),
('1660235102467', 145, 6, 0, 800, 8, 4, 'camp', 'A1.jpeg', '木棧板區', '2', '2022-08-27', '2022-08-29', '2022-08-11 16:25:02'),
('1660235512586', 145, 8, 0, 20800, 3, 1, 'beauty', 'roomC1.jpeg', '印第安帳', '1', '2022-08-27', '2022-08-28', '2022-08-11 16:31:52'),
('1660235824480', 145, 6, 0, 800, 8, 4, 'camp', 'A1.jpeg', '木棧板區', '1', '2022-08-26', '2022-08-27', '2022-08-11 16:37:04'),
('1660236080402', 145, 4, 0, 12800, 1, 1, 'beauty', 'roomA8.jpeg', '頂級星空帳', '1', '2022-08-17', '2022-08-18', '2022-08-11 16:41:20'),
('1660269844557', 145, 6, 0, 800, 8, 4, 'camp', 'A1.jpeg', '木棧板區', '1', '2022-08-19', '2022-08-20', '2022-08-12 02:04:04'),
('1660269974615', 145, 6, 0, 1200, 9, 4, 'camp', 'B1.jpeg', '搭棚遮雨區', '1', '2022-08-26', '2022-08-27', '2022-08-12 02:06:14'),
('17', 145, 8, 0, 20800, 3, 1, 'beauty', 'roomC1.jpeg', '印第安帳', '', '2022-08-12', '2022-08-13', '2022-08-11 07:22:49'),
('18', 145, 4, 0, 5800, 4, 2, 'family', 'family-typeC5.jpg', '親子同遊帳', '', '2022-09-21', '2022-09-22', '2022-08-11 11:45:05'),
('2', 145, 4, 0, 4800, 7, 3, 'van', 'campingVan_B1.jpeg', '賞星露營車', '', '2022-08-12', '2022-08-13', '2022-08-11 03:43:27'),
('3', 145, 4, 0, 4800, 7, 3, 'van', 'campingVan_B1.jpeg', '賞星露營車', '', '2022-08-13', '2022-08-19', '2022-08-11 03:43:27'),
('4', 145, 6, 0, 16800, 2, 1, 'beauty', 'roomE1.jpeg', '網美神殿帳', '', '2022-08-12', '2022-08-13', '2022-08-11 03:47:59'),
('5', 145, 6, 0, 800, 8, 4, 'camp', 'A1.jpeg', '木棧板區', '', '2022-08-12', '2022-08-13', '2022-08-11 03:57:06'),
('6', 145, 6, 0, 800, 8, 4, 'camp', 'A1.jpeg', '木棧板區', '', '2022-08-12', '2022-08-13', '2022-08-11 05:18:53'),
('7', 145, 4, 0, 12800, 1, 1, 'beauty', 'roomA8.jpeg', '頂級星空帳', '', '2022-08-26', '2022-08-27', '2022-08-11 05:18:53'),
('8', 145, 6, 2, 16800, 2, 1, 'beauty', 'roomE1.jpeg', '網美神殿帳', '', '2022-08-19', '2022-08-20', '2022-08-11 05:18:53'),
('9', 145, 6, 2, 1200, 9, 4, 'camp', 'B1.jpeg', '搭棚遮雨區', '', '2022-08-12', '2022-08-13', '2022-08-11 05:18:53');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `order_detail`
--
ALTER TABLE `order_detail`
  ADD PRIMARY KEY (`order_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
